# Задание 1
name = input('Введите своё имя: ')
surname = input('Введите вашу фамилию: ')
print(f'Приветствую вас, {surname} {name}!')
age = int(input(f'{name}, введите ваш возраст: '))
age_30 = age + 30
while age % 5 == 0:
    print(f'Поздравляю, {name}, у Вас юбилей.')
    break
print(f'Через 30 лет Вам, {name}, будет {age_30} лет.')
print(f'{surname} {name}, желаю Вам хорошего дня!')
